s = ['a', 'b', 'c', 'd', 'e', 'g']
print(s)
print(s[0])
s[0] = 'x'  #要素の置換
print(s)
print(s[2:5])
s[2:5] = ['C', 'D', 'E']    #複数の要素の置換
print(s)
s[2:5] = []     #要素を空にする
print(s)
s[:] = []
print(s)
"""
['a', 'b', 'c', 'd', 'e', 'g']
a
['x', 'b', 'c', 'd', 'e', 'g']
['c', 'd', 'e']
['x', 'b', 'C', 'D', 'E', 'g']
['x', 'b', 'g']
[]
"""


n = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
n.append(100)       #要素の追加
print(n)
n.insert(0, 200)    #1番目を20に置換
print(n)
n.pop()             #最後の要素を取り出す（除去）
print(n)
n.pop(0)            #1番目の要素を取り出す（除去）
print(n)
del n[0]            #指定した要素を削除
print(n)
del n               #変数nを削除
n = [1, 2, 2, 2, 3]
n.remove(2)         #最初にヒットする2を削除
print(n)
"""
[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 100]
[200, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 100]
[200, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
[2, 3, 4, 5, 6, 7, 8, 9, 10]
[1, 2, 2, 3]
"""


a = [1, 2, 3, 4, 5]
b = [6, 7, 8, 9, 10]
print(a + b)
a += b
print(a)
x = [1, 2, 3, 4, 5]
y = [6, 7, 8, 9, 10]
x.extend(y)
print(x)
"""
[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
"""


