i = [1, 2, 3, 4, 5]
j = i
print('j =', j)
print('i =', i)
j[0] = 100
print('j =', j)
print('i =', i)
"""
j = [1, 2, 3, 4, 5]
i = [1, 2, 3, 4, 5]

↓ j[0] = 100　を実行すると

j = [100, 2, 3, 4, 5]
i = [100, 2, 3, 4, 5]
"""

#参照渡しを回避するためには
x = [1, 2, 3, 4, 5]
y = x.copy()
y[0] = 100
print('y =', y)
print('x =', x)
"""
y = [100, 2, 3, 4, 5]
x = [1, 2, 3, 4, 5]
"""

X = 20
y = X
Y = 5
print(id(X))
print(id(Y))
print(X)
print(Y)
"""
4486393168
4486392688
20
5
"""

X = ['a', 'b']
Y = X
Y[0] = 'p'
print(id(X))
print(id(Y))
"""
20
5
4377892928
4377892928
"""

